CREATE DATABASE dbpj;

CREATE TABLE product(
        pdname VARCHAR(20) PRIMARY KEY,
        brand VARCHAR(20) NOT NULL,
        detail VARCHAR(350) NOT NULL,
        images TEXT NOT NULL,
        price VARCHAR(10) NOT NULL
        );

INSERT INTO product (pdname,brand,detail,images,price)
VALUES  ('ทีวี','samsung','เพลินไปกับความคมชัดเห็นรายละเอียด ภาพทั้งฉากมืดและสว่าง ให้สีสวยเป็นธรรมชาติ  มี Wifi เพื่อเชื่อมต่ออุปกรณ์เสริมอื่นๆได้ เทคโนโลยี HDR ในการช่วยปรับความชัดและแสงของภาพให้มีมิติที่เสมือนจริงที่สุด ลำโพงพลังเสียงรวมถึง 20 วัตต์ให้เสียงกระหึ่มยิ่งขึ้น ด้วย ลำโพง 2.0 ช่องสัญญาณ','pd2.png','7,990'),
        ('พัดลม','sharp','ชาร์ป พัดลมตั้งโต๊ะ ขนาด 16 นิ้ว รุ่น PJ-TA163 ขบวนการเย็นแรงกระจาย สบายทั่วถึง ลมแรงสะใจกับพัดลมชาร์ปด้วย Widewind Technology เพิ่มองศาใบพัด ลมแรงเป็นวงกว้างได้มากกว่า ปรับแรงลมได้ 3 ระดับ ขนาด กว้าง 464 มม. สูง 692 มม. ลึก 356 มม. ความปลอดภัย 3 ระบบ THERMAL FUSE ระบบตัดไฟอัติโนมัติ','pd4.png','990'),
        ('หม้อหุงข้าว','sharp','หม้อหุงข้าวดิจิตอล ขนาดความจุ 1.8 ลิตร หม้อหุงข้าวอัจฉริยะ ใช้งานง่าย เพียงกดปุ่มเดียวได้ทุกเมนูที่ต้องการ ไม่ว่าจะเป็นการหุงข้าวสวย ข้าวต้ม โจ๊ก ข้าวกล้อง ข้าวเหนียว เค้ก ขนมปัง หรือตุ๋นอาหาร และหม้อในเคลือบโพลีฟลอน (POLY-FLON) ข้าวจึงไม่ติดหม้อ ทำความสะอาดง่าย ขนาดควาจุ 1.8 ลิตร ได้รับการรับรองจากสำนักงานอาหารและยาของประเทศญี่ปุ่น','pd1.jpg','2,990'),
        ('เครื่องซักผ้า','panasonic','เครื่องซักผ้าฝาบน ขนาด 8 กก. ผงซักฟอกจะถูกเปลี่ยนเป็นโฟมทำความสะอาดที่มีความเข้มข้นสูงและหนาแน่น แทรกซึมเข้าสู่เสื้อผ้าและจัดการกับคราบไขมันและสิ่งสกปรกภายในเนื้อผ้าได้อย่างล้ำลึก แผงควมคุมดีไซน์ใหม่ เพื่อการใช้งานที่สะดวกยิ่งขึ้น เครื่องซักผ้ารุ่นนี้จึงถูกดีไซน์ให้ตัวอักษรใหญ่และอ่านง่ายขึ้น ใช้สัญลักษณ์แทนตัวหนังสือเพื่อการมองเห็นที่ง่ายขึ้น','pd3.png','7,190'),
        ('เครื่องดูดฝุ่น','philips','เครื่องดูดฝุ่นขนาดกะทัดรัด 1400 วัตต์ มีอุปกรณ์เสริม 3 ชิ้นข้าถึงทุกซอกมุมด้วยมือจับออกแบบตามสรีรศาสตร์มีความยาวพิเศษเข้าถึงทุกซอกมุมด้วยมือจับออกแบบตามสรีรศาสตร์มีความยาวพิเศษ มือจับที่ออกแบบตามสรีรศาสตร์นี้ช่วยให้สะดวกในการใช้งาน การออกแบบให้มีความยาวพิเศษช่วยให้คุณซอกซอนได้ไกลยิ่งขึ้น ด้ามจับพิเศษง่ายต่อการถือ พร้อมฟังก์ชันหมุนเก็บสายไฟ','pd5.png','2,390'),
        ('เครื่องฟอกอากาศ','philips','โหมดการฟอกอากาศอัตโนมัติที่อัจฉริยะด้วยเซนเซอร์ระดับอุตสาหกรรม ที่จะตรวจจับและตอบสนองต่อการเปลี่ยนแปลงแม้เพียงเล็กน้อยในอากาศโดยอัตโน มัติสัญญาณไฟ 4 สี แสดงคุณภาพอากาศแบบเรียลไทม์โดยมีตั้งแต่สีฟ้า (ดี) ไปจนถึงสีแดง (แย่) ให้ความมั่นใจคุณในเรื่องของคุณภาพอากาศในบ้านขนาดกะ ทัดรัดวางได้ง่ายในทุกที่ของบ้านคุณ เหมาะห้องที่มีขนาด 532 ตารางฟุต','pd6.png','5,990');

     